content/reverse-polish-notation.org
#+TITLE: Polish and Reverse Polish Notation
#+SUBTITLE: An Alternative Way of Writing Mathematical Expressions
#+DATE: [2023-03-29 wo]
#+AUTHOR: shrirambo
#+DESCRIPTION: Polish and Reverse Polish notation uses prefix and postfix operator instead on usual infix operator making it easire to implement computer programs to parse and solve these mathematical expressions
#+KEYWORDS: notation, polish notation, reverse polish notataion, postfix, prefix, infix, maths, mathematical, expressions
#+OPTIONS: tex:t toc:nil
------

#+begin_quote
"Mathematics is a language. Language is a tool. Like any other tool, it has limitations. But language is a tool for dealing with the world as it is. Mathematics is a tool for dealing with the world as it might be. The study of mathematics is not a pursuit of logic; it is a pursuit of language. The language of mathematics is the language of the universe itself."

--Alfred North Whitehead
#+end_quote

Mathematics, or at least what we write on paper, is a language like english and german used to communicate ideas. This language is just a set of rules that we have aggreed upon, so that everyone is on same page when one say what is ~3 * 5 + 2 - 1~. The thing with the language is that multiple ones can co-exist with each one having some benefit over the other. Similar with the programming languages, each one has special use cases but in the core the logic is same. Just the way to write can be different. In the same way, there exist multiple different ways of writing mathematical expressions which, if you know the rules, expresses the same idea. More on that later. But let me first give some context on how I found out about these altrnate notation and how it solved (to some extent) the problem I had.

* Context

At work, I had to implement a feature for an app which will allow users to fetch documents from database based on provided parameters. One of the parameter was ~keywords~. I wanted the let user srerch documents with a specific keyword. Simple enough. User passes a value for parameter, say ~keywords= "hello"~ and the server will fetch all the documents with the word ~hello~ in it and return them.

Then, somebody wanted to narrow the search by looking for multiple keywords in the document (of course, the parameter is named ~keywords~ and not ~keyword~; so that's fair). So, I let the user pass multiple keywords as a string like ~keywords= "hello there".~ This will return all the documents which has both words ~hello~ and ~there~.

What if I want documents with one word in it and the other word not in it. Said the person with a purple top hat and a coy smile. To which I said, add an exclaimation mark in front of it you silly. Now, when one passes ~keywords= "hello !there",~ he will get all the documents with ~hello~ in it and ~there~ not in it.

Another guy came to me asking if he can ask for multiple keywords and get all the documents with any of the keywords in it. He wanted to make his search more broad. That request also seemd fair. So, I let the user pass multiple keywords as a string, but this time separated by a comma, to convey that he is looking for keywords in logical disjunction i.e. if a user passes ~keywords= "hello, there~ , then he will get all the documents with either ~hello~ in it or ~there~ in it.

Now, the basic parsing logic was: a space in the string will mean logical ~AND~, a comma in the string will represent logical ~OR,~ and an exclaimation mean logical ~NOT~. So when ~keywords= "hello there, general !kenobi"~ means ~hello AND there OR general AND NOT kenobi~. In logic, ~AND~ is like multiplication and ~OR~ is like addition, and ~NOT~ is like an operator. Therefore, the inambiguous expression will be ~(hello AND there) OR (general AND (NOT kenobi))~ __Replace each word with a boolean that the word is in the document, if the expression evaluates to ~True~ then that document will be returned.__

(Me sighing while wiping sweat from my forehead) Everything anyone will ever need to create a query as complicated as on can, has been implemented. Or so I thought. With implicit precedence of ~NOT~ over ~AND~ orver ~OR~, I can only create queries with limited complexity. What if I wanted to make a query like ~((old AND ben) OR (obi AND van) OR general) AND kenobi~? One solution is expanding the expression and writing ~keywords= "obi van kenobi, old ben kenobi, general kenobi"~ which is an expanded version. But expanding nested complicated expression will lead to a very long string with a lot of repetation that the user has to type. It will still be easier to parse by the computer but the user has to expand and write it all out.

Another solution could be introduce the brackets in the expression i.e. let user write the expression in nested brackets. Easy for user to write but complicated for computer to parse. 

Can there be any better implementation which will make it easy for the user to write and easy for the computer to parse, and also pollibly without using brackets. Well...

#+begin_export html
<div style="width:100%;height:0;padding-bottom:76%;position:relative;"><iframe src="https://giphy.com/embed/l2JdXaF36UcSHpSx2" width="100%" height="100%" style="position:absolute" frameBorder="0" class="giphy-embed" allowFullScreen></iframe></div><p><a href="https://giphy.com/gifs/thesimpsons-l2JdXaF36UcSHpSx2">via GIPHY</a></p>
#+end_export

