reverse-polish-notation.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Polish and Reverse Polish Notation</title>
<meta name="generator" content="Org mode">
<meta name="description" content="Polish and Reverse Polish notation uses prefix and postfix operator instead on usual infix operator making it easire to implement computer programs to parse and solve these mathematical expressions"
>
<meta name="keywords" content="notation, polish notation, reverse polish notataion, postfix, prefix, infix, maths, mathematical, expressions">
<link rel='stylesheet' href='./css/code.css' />
<link rel='stylesheet' href='./css/simple.css' />
<link rel='shortcut icon' href='./img/favicon.ico' type='image/x-icon' />
<link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/fork-awesome@1.2.0/css/fork-awesome.min.css' integrity='sha256-XoaMnoYC5TH6/+ihMEnospgm0J1PM/nioxbOUdnM8HY=' crossorigin='anonymous'>
</head>
<body>
<header id="top" class="status">
<a href="./index.html">shrirambo</a>.<a href="https://github.com/shrirambo">github</a>.<a href="">io</a>/<a href="./index.html">home</a>/<a href="./index.html">blog</a>
</header>
<main id="content">
<h1 class="title">Polish and Reverse Polish Notation
<br>
<span class="subtitle">An Alternative Way of Writing Mathematical Expressions</span>
</h1>
<hr>

<blockquote>
<p>
"Mathematics is a language. Language is a tool. Like any other tool, it has limitations. But language is a tool for dealing with the world as it is. Mathematics is a tool for dealing with the world as it might be. The study of mathematics is not a pursuit of logic; it is a pursuit of language. The language of mathematics is the language of the universe itself."
</p>

<p>
&#x2013;Alfred North Whitehead
</p>
</blockquote>

<p>
Mathematics, or at least what we write on paper, is a language like english and german used to communicate ideas. This language is just a set of rules that we have aggreed upon, so that everyone is on same page when one say what is <code>3 * 5 + 2 - 1</code>. The thing with the language is that multiple ones can co-exist with each one having some benefit over the other. Similar with the programming languages, each one has special use cases but in the core the logic is same. Just the way to write can be different. In the same way, there exist multiple different ways of writing mathematical expressions which, if you know the rules, expresses the same idea. More on that later. But let me first give some context on how I found out about these altrnate notation and how it solved (to some extent) the problem I had.
</p>

<section id="outline-container-org875c2d0" class="outline-2">
<h2 id="org875c2d0"><a href="#org875c2d0">Context</a></h2>
<div class="outline-text-2" id="text-org875c2d0">
<p>
At work, I had to implement a feature for an app which will allow users to fetch documents from database based on provided parameters. One of the parameter was <code>keywords</code>. I wanted the let user srerch documents with a specific keyword. Simple enough. User passes a value for parameter, say <code>keywords= "hello"</code> and the server will fetch all the documents with the word <code>hello</code> in it and return them.
</p>

<p>
Then, somebody wanted to narrow the search by looking for multiple keywords in the document (of course, the parameter is named <code>keywords</code> and not <code>keyword</code>; so that's fair). So, I let the user pass multiple keywords as a string like <code>keywords= "hello there".</code> This will return all the documents which has both words <code>hello</code> and <code>there</code>.
</p>

<p>
What if I want documents with one word in it and the other word not in it. Said the person with a purple top hat and a coy smile. To which I said, add an exclaimation mark in front of it you silly. Now, when one passes <code>keywords= "hello !there",</code> he will get all the documents with <code>hello</code> in it and <code>there</code> not in it.
</p>

<p>
Another guy came to me asking if he can ask for multiple keywords and get all the documents with any of the keywords in it. He wanted to make his search more broad. That request also seemd fair. So, I let the user pass multiple keywords as a string, but this time separated by a comma, to convey that he is looking for keywords in logical disjunction i.e. if a user passes <code>keywords= "hello, there</code> , then he will get all the documents with either <code>hello</code> in it or <code>there</code> in it.
</p>

<p>
Now, the basic parsing logic was: a space in the string will mean logical <code>AND</code>, a comma in the string will represent logical <code>OR,</code> and an exclaimation mean logical <code>NOT</code>. So when <code>keywords= "hello there, general !kenobi"</code> means <code>hello AND there OR general AND NOT kenobi</code>. In logic, <code>AND</code> is like multiplication and <code>OR</code> is like addition, and <code>NOT</code> is like an operator. Therefore, the inambiguous expression will be <code>(hello AND there) OR (general AND (NOT kenobi))</code> <span class="underline"><span class="underline">Replace each word with a boolean that the word is in the document, if the expression evaluates to <code>True</code> then that document will be returned.</span></span>
</p>

<p>
(Me sighing while wiping sweat from my forehead) Everything anyone will ever need to create a query as complicated as on can, has been implemented. Or so I thought. With implicit precedence of <code>NOT</code> over <code>AND</code> orver <code>OR</code>, I can only create queries with limited complexity. What if I wanted to make a query like <code>((old AND ben) OR (obi AND van) OR general) AND kenobi</code>? One solution is expanding the expression and writing <code>keywords= "obi van kenobi, old ben kenobi, general kenobi"</code> which is an expanded version. But expanding nested complicated expression will lead to a very long string with a lot of repetation that the user has to type. It will still be easier to parse by the computer but the user has to expand and write it all out.
</p>

<p>
Another solution could be introduce the brackets in the expression i.e. let user write the expression in nested brackets. Easy for user to write but complicated for computer to parse. 
</p>

<p>
Can there be any better implementation which will make it easy for the user to write and easy for the computer to parse, and also pollibly without using brackets. Well&#x2026;
</p>

<div style="width:100%;height:0;padding-bottom:76%;position:relative;"><iframe src="https://giphy.com/embed/l2JdXaF36UcSHpSx2" width="100%" height="100%" style="position:absolute" frameBorder="0" class="giphy-embed" allowFullScreen></iframe></div><p><a href="https://giphy.com/gifs/thesimpsons-l2JdXaF36UcSHpSx2">via GIPHY</a></p>
</div>
</section>
