reverse-polish-notation.html

<section id="outline-container-org90d73ec" class="outline-2">
<h2 id="org90d73ec"><a href="#org90d73ec">The Prefix Notation</a></h2>
<div class="outline-text-2" id="text-org90d73ec">
<p>
Usually, for the common operators, we use infix notation i.e. the operator is surrounded by two oparands on which it is operating on. For example <code>2 + 3</code>, here the operator + is in between 2 and 3 and it is trying to add these two numbers. In the prefix notation, we write the operator before the operands. So this will become <code>+ 2 3.</code> This also seems logical as in most of programming languages, we write function before the parameters (<code>add(2, 3</code>). And as long as the number of parameters/oparands is fixed, we do not need brackets. When reading from left to right, if the two elements after the operator + are numbers, then we add those two numbers e.g. <code>+ 2 - 5 1</code> becomes <code>+ 2 4</code> becomes <code>6</code>. Note that here <code>-</code> is operator and not representing negative number <code>-5</code>. So if there are enough number of operands for an operator, carry out the operation.
</p>

<div style="width:100%;height:0;padding-bottom:73%;position:relative;"><iframe src="https://giphy.com/embed/RLzkD9nLJ2vMYsTv0x" width="100%" height="100%" style="position:absolute" frameBorder="0" class="giphy-embed" allowFullScreen></iframe></div><p><a href="https://giphy.com/gifs/statechamps-state-champs-crying-out-loud-cryingoutloud-RLzkD9nLJ2vMYsTv0x">via GIPHY</a></p>

<p>
This Prefix Notation is also known as the Polish Notation, named after the nationality of Jan Łukasiewicz, the mathematician who invented it. Guess the country where he is from&#x2026; In our use case, we can write <code>obi AND kenobi</code> in prefix notation as <code>AND obi kenobi</code> where <code>AND</code> is operator and <code>obi kenobi</code> ane operands. And we can write the expression <code>((old AND ben) OR (obi AND van) OR general) AND kenobi</code> in prefix notation as <code>AND OR OR AND old ben AND obi van general kenobi</code>. We solved two problems with this infix notation. No more brackets and no repetation of expressions! 🥳 
</p>

<p>
Here are some observation:
</p>

<ul class="org-ul">
<li>Expression always starts witn an operator and ends with an operand.</li>
<li>The operators are more concentrated towards the left side of expression.</li>
<li>The operands are concentrated towards the right side of the expression.</li>
<li>The oder of the operation is from right to left, i.e. the right most operator is evaluated first, then the next right most and then the next&#x2026;.</li>
</ul>

<p>
This makes the implementation of a computer program to evaluate such expression quite simple. Neither you  need brakets nor you need a proirity of which operator gets precdence over the other. The parsing algorithm can be explained as follows:
</p>

<ul class="org-ul">
<li>Break the string expression in tokens and start from the right.</li>
<li>If the token is an operand, add it to the stack.</li>
<li>If the token is an operator and that operator needs N operands to work on, pop last N operands from the stack, apply the operation and put the result back on the stack.</li>
<li>Keep doing that until all of the tokens are exhausted.</li>
<li>The last remaining operand on the stack is the answer.</li>
</ul>

<p>
Let's look at an example here. Consider the expression
</p>

<pre class="example">
Infix Notation: ((9 - 5) * 8 / 2) + (6 - 3) * 2 * 2
Step 1:         (4 * 8 / 2 ) + (6 - 3) * 2 * 2
Step 2:         (4 * 4) + (6 - 3) * 2 * 2
Step 3:         16 + (6 - 3) * 2 * 2
Step 4:         16 + 3 * 2 * 2
Step 5:         16 + 6 * 2
Step 6:         16 + 12
Step 7:         28
</pre>

<p>
Now, to solve the same expression in prefix notation, we use the algorighm and go over the expression from right to left:
</p>

<pre class="example">
Prefix Notation: + / * - 9 5 8 2 * * - 6 3 2 2
Step  1: 2                                 add     2   to stack Stack= 2
Step  2: 2                                 add     2   to stack Stack= 2 2
Step  3: 3                                 add     3   to stack Stack= 2 2 3
Step  4: 6                                 add     6   to stack Stack= 2 2 3 6
Step  5: - remove  6 and  3 from stack and add - 6 3   to stack Stack= 2 2 3
Step  6: * remove  3 and  2 from stack and add * 3 2   to stack Stack= 2 6
Step  7: * remove  6 and  2 from stack and add * 6 2   to stack Stack= 12
Step  8: 2                                 add     2   to stack Stack= 12 2
Step  9: 8                                 add     8   to stack Stack= 12 2 8
Step 10: 5                                 add     5   to stack Stack= 12 2 8 5
Step 11: 9                                 add     9   to stack Stack= 12 2 8 5 9
Step 12: - remove  9 and  5 from stack and add - 9 5   to stack Stack= 12 2 8 4
Step 13: * remove  8 and  4 from stack and add * 8 4   to stack Stack= 12 2 32
Step 14: / remove 20 and  2 from stack and add / 20 2  to stack Stack= 12 16
Step 15: + remove 12 and 16 from stack and add + 12 16 to stack Stack= 28
</pre>

<p>
Looks like way more steps than the infix notation but in the infix, we have to go over the whole expression back and forth to find the operator with highest precedence to evaluate before the rest (based on the famous <b>BODMAS</b> rule which is not shown in the steps so add may be 10 more intermediate steps for that and another 100 steps to figure out where the bracket starts and ends). On the other hand, in the prefix notation; we go over the expression, one toke at a time, from right to left and only once. No more hidden steps. Easy peasy.
</p>
<div style="width:100%;height:0;padding-bottom:82%;position:relative;"><iframe src="https://giphy.com/embed/KWhzYRArxnE9U0ioHW" width="100%" height="100%" style="position:absolute" frameBorder="0" class="giphy-embed" allowFullScreen></iframe></div><p><a href="https://giphy.com/gifs/reaction-mood-KWhzYRArxnE9U0ioHW">via GIPHY</a></p>

<p>
There is still one small problem with this prefix notation. Say we want to extend the above expressoin and add <code>+ * 2 3 1</code> to it. In that case we have to prepend a <code>+</code> and append the expression <code>+ * 2 3 1</code> to the original expression. This results in adding tokens in both start and end of the expression (<code>+ + / * - 9 5 8 2 * * - 6 3 2 2 + * 2 3 1</code>). Now, the order of operation will look a little different and  the stack will look a little different. And you cannot stop in the middle, update the expression and continue. You have to either finish all the steps and then update the expression or update it first and re-do all the steps. Can we do better than this?
</p>

<div style="width:100%;height:0;padding-bottom:100%;position:relative;"><iframe src="https://giphy.com/embed/GxBk3vZy86tKiENJQ4" width="100%" height="100%" style="position:absolute" frameBorder="0" class="giphy-embed" allowFullScreen></iframe></div><p><a href="https://giphy.com/gifs/helloall-happy-thanksgiving-happythanksgiving-family-GxBk3vZy86tKiENJQ4">via GIPHY</a></p> 
</div>
</section>
