content/reverse-polish-notation.org
* The Postfix Notation

Also called as Reverse Polish Notation. It is just Polish notation but in reverse. As oppose to the prefix notation, in postfix we write the operator after the operands for example the infix expression ~2 + 3~ will become ~2 3 +~ in postfix. And our logical expression  ~((old AND ben) OR (obi AND van) OR general) AND kenobi~ in postfix will become ~old ben AND obi van AND OR general OR kenobi AND~. Notice that in postfix expression

- Expression always starts witn an operand and ends with an operator.
- The operators are more concentrated towards the right side of expression.
- The operands are concentrated towards the left side of the expression.
- The order of evaluation of operators is from left to right.

Left to right!!! Makes more sense now. We also read left to right (in most of the languages). The algorithm to evaluate postfix expression is very similar to that of prefix expression but in reverse order:

+ Break the string expression in tokens and start from the left.
+ The rest is same as before 😉

Let us look at the same example of infix expression ~((9 - 5) * 8 / 2) + (6 - 3) * 2 * 2~ and solve it in postfix:

#+begin_example
Prefix Notation: 9 5 - 8 * 2 / 6 3 - 2 * 2 * +
Step  1: 9                                 add     9   to stack Stack= 9       #Like step 11 
Step  2: 5                                 add     5   to stack Stack= 9 5     #Like step 10
Step  3: - remove  9 and  5 from stack and add - 9 5   to stack Stack= 4       #Like step 12
Step  4: 8                                 add     8   to stack Stack= 4 8     #Like step 9
Step  5: * remove  8 and  4 from stack and add * 8 4   to stack Stack= 32      #Like step 13
Step  6: 2                                 add     2   to stack Stack= 32 2    #Like step 8
Step  7: / remove 32 and  2 from stack and add / 32 2  to stack Stack= 16      #Like step 14
Step  8: 6                                 add     6   to stack Stack= 16 6    #Like step 4
Step  9: 3                                 add     3   to stack Stack= 16 6 3  #Like step 3
Step 10: - remove  6 and  3 from stack and add - 6 3   to stack Stack= 16 3    #Like step 5
Step 11: 2                                 add     2   to stack Stack= 16 3 2  #Like step 1
Step 12: * remove  3 and  2 from stack and add * 3 2   to stack Stack= 16 6    #Like step 6
Step 13: 2                                 add     2   to stack Stack= 16 6 2  #Like step 2
Step 14: * remove  6 and  2 from stack and add * 6 2   to stack Stack= 16 12   #Like step 7
Step 15: + remove 16 and 12 from stack and add + 16 12 to stack Stack= 28      #Like step 15
#+end_example

Very similar to prefix notation. Also, the steps are kind of similar to prefix steps but in different order and the stack looks a bit different. Now let's say that we already evaluated till step 14 and we want to add the expression ~2 3 * 1 +~ (i.e. ~2*3 + 1~ in infix), we just update the expression and continue our steps without having to restart:

#+begin_example
Prefix Notation: 9 5 - 8 * 2 / 6 3 - 2 * 2 * +
Step 14: * remove  6 and  2 from stack and add * 6 2   to stack Stack= 16 12
Updated Expression: 9 5 - 8 * 2 / 6 3 - 2 * 2 * + 2 3 * 1 + +
Step 15: + remove 16 and 12 from stack and add + 16 12 to stack Stack= 28
Step 16: 2                                 add     2   to stack Stack= 28 2
Step 17: 3                                 add     3   to stack Stack= 28 2 3
Step 18: * remove  2 and  3 from stack and add * 2 3   to stack Stack= 28 6
Step 19: 1                                 add     1   to stack Stack= 28 6 1
Step 20: + remove  6 and  1 from stack and add + 6 1   to stack Stack= 28 7
Step 21: + remove 28 and  7 from stack and add + 28 7  to stack Stack= 35
#+end_example

That way, we can continue the evaluation steps even if the expression is updated (as long as the update happens after the current token). This is not possible in prefix notation as the expression most of the times gets updated from both ends. 


* Partially Application of Operators aka Currying

There is one more benifit of Prefix and Postfix notation that we haven't talked about. The Prefix and postfix notation also allows *Currying*. Currying is a concept from functional programming that allows us to apply functions (in our case operators) partially and create new functions from it. Check this out: When using prefix notation, let me define ~X = + 3~. I can say that ~X~ an operator that takes one operand and adds 3 to it i.e. ~X 2 = + 3 2 = 5~. Here I can use ~X~ as a partially applied addition. In postfix it will be ~X = 3 +~ and ~2 X = 2 3 + = 5~. It is not possible to do this in infix notation. As Łukasiewicz said, the prefix notation allows to write and prove theorems much more easily.

* Conclusion

So, there we have it. A different way of writing mathematical expressions that:
1. Do not require brackets.
2. Avoids repetation of tokens.
3. Easy to implement parsing algorithm.
4. Easy to adapt to modification of the expression.
5. Allows partial application of operator or Currying
6. And difficult to write and comprehend by humans. Wait. Noooooooo.

Hooman brain has now adjusted to comprehend mathematical expressions with brackets and it is hard for us to adapt now to Postfix notation. That is the upside of using infix notation and brackets. Because most of the world uses it. And it will be difficult to switch everyone to the prefix or postfix. I cannot make users to write query in postfix notation. That will be very unintuitive. Specially for people without mathematics background. So, I will just let them write keywords separated by commas and spaces and let them think about the expanded form which might invlove long expression with a lot of repetation. But they might never need to...

I am thinking about what should I eat for dinner. The restaurant next to my house serves and and and burgers fries milkshakes not and salads sushi.
