reverse-polish-notation.html

<section id="outline-container-org15ecaad" class="outline-2">
<h2 id="org15ecaad"><a href="#org15ecaad">The Postfix Notation</a></h2>
<div class="outline-text-2" id="text-org15ecaad">
<p>
Also called as Reverse Polish Notation. It is just Polish notation but in reverse. As oppose to the prefix notation, in postfix we write the operator after the operands for example the infix expression <code>2 + 3</code> will become <code>2 3 +</code> in postfix. And our logical expression  <code>((old AND ben) OR (obi AND van) OR general) AND kenobi</code> in postfix will become <code>old ben AND obi van AND OR general OR kenobi AND</code>. Notice that in postfix expression
</p>

<ul class="org-ul">
<li>Expression always starts witn an operand and ends with an operator.</li>
<li>The operators are more concentrated towards the right side of expression.</li>
<li>The operands are concentrated towards the left side of the expression.</li>
<li>The order of evaluation of operators is from left to right.</li>
</ul>

<p>
Left to right!!! Makes more sense now. We also read left to right (in most of the languages). The algorithm to evaluate postfix expression is very similar to that of prefix expression but in reverse order:
</p>

<ul class="org-ul">
<li>Break the string expression in tokens and start from the left.</li>
<li>The rest is same as before 😉</li>
</ul>

<p>
Let us look at the same example of infix expression <code>((9 - 5) * 8 / 2) + (6 - 3) * 2 * 2</code> and solve it in postfix:
</p>

<pre class="example">
Prefix Notation: 9 5 - 8 * 2 / 6 3 - 2 * 2 * +
Step  1: 9                                 add     9   to stack Stack= 9       #Like step 11 
Step  2: 5                                 add     5   to stack Stack= 9 5     #Like step 10
Step  3: - remove  9 and  5 from stack and add - 9 5   to stack Stack= 4       #Like step 12
Step  4: 8                                 add     8   to stack Stack= 4 8     #Like step 9
Step  5: * remove  8 and  4 from stack and add * 8 4   to stack Stack= 32      #Like step 13
Step  6: 2                                 add     2   to stack Stack= 32 2    #Like step 8
Step  7: / remove 32 and  2 from stack and add / 32 2  to stack Stack= 16      #Like step 14
Step  8: 6                                 add     6   to stack Stack= 16 6    #Like step 4
Step  9: 3                                 add     3   to stack Stack= 16 6 3  #Like step 3
Step 10: - remove  6 and  3 from stack and add - 6 3   to stack Stack= 16 3    #Like step 5
Step 11: 2                                 add     2   to stack Stack= 16 3 2  #Like step 1
Step 12: * remove  3 and  2 from stack and add * 3 2   to stack Stack= 16 6    #Like step 6
Step 13: 2                                 add     2   to stack Stack= 16 6 2  #Like step 2
Step 14: * remove  6 and  2 from stack and add * 6 2   to stack Stack= 16 12   #Like step 7
Step 15: + remove 16 and 12 from stack and add + 16 12 to stack Stack= 28      #Like step 15
</pre>

<p>
Very similar to prefix notation. Also, the steps are kind of similar to prefix steps but in different order and the stack looks a bit different. Now let's say that we already evaluated till step 14 and we want to add the expression <code>2 3 * 1 +</code> (i.e. <code>2*3 + 1</code> in infix), we just update the expression and continue our steps without having to restart:
</p>

<pre class="example">
Prefix Notation: 9 5 - 8 * 2 / 6 3 - 2 * 2 * +
Step 14: * remove  6 and  2 from stack and add * 6 2   to stack Stack= 16 12
Updated Expression: 9 5 - 8 * 2 / 6 3 - 2 * 2 * + 2 3 * 1 + +
Step 15: + remove 16 and 12 from stack and add + 16 12 to stack Stack= 28
Step 16: 2                                 add     2   to stack Stack= 28 2
Step 17: 3                                 add     3   to stack Stack= 28 2 3
Step 18: * remove  2 and  3 from stack and add * 2 3   to stack Stack= 28 6
Step 19: 1                                 add     1   to stack Stack= 28 6 1
Step 20: + remove  6 and  1 from stack and add + 6 1   to stack Stack= 28 7
Step 21: + remove 28 and  7 from stack and add + 28 7  to stack Stack= 35
</pre>

<p>
That way, we can continue the evaluation steps even if the expression is updated (as long as the update happens after the current token). This is not possible in prefix notation as the expression most of the times gets updated from both ends. 
</p>
</div>
</section>


<section id="outline-container-orgbd44419" class="outline-2">
<h2 id="orgbd44419"><a href="#orgbd44419">Partially Application of Operators aka Currying</a></h2>
<div class="outline-text-2" id="text-orgbd44419">
<p>
There is one more benifit of Prefix and Postfix notation that we haven't talked about. The Prefix and postfix notation also allows <b>Currying</b>. Currying is a concept from functional programming that allows us to apply functions (in our case operators) partially and create new functions from it. Check this out: When using prefix notation, let me define <code>X = + 3</code>. I can say that <code>X</code> an operator that takes one operand and adds 3 to it i.e. <code>X 2 = + 3 2 = 5</code>. Here I can use <code>X</code> as a partially applied addition. In postfix it will be <code>X = 3 +</code> and <code>2 X = 2 3 + = 5</code>. It is not possible to do this in infix notation. As Łukasiewicz said, the prefix notation allows to write and prove theorems much more easily.
</p>
</div>
</section>

<section id="outline-container-org4d02cfb" class="outline-2">
<h2 id="org4d02cfb"><a href="#org4d02cfb">Conclusion</a></h2>
<div class="outline-text-2" id="text-org4d02cfb">
<p>
So, there we have it. A different way of writing mathematical expressions that:
</p>
<ol class="org-ol">
<li>Do not require brackets.</li>
<li>Avoids repetation of tokens.</li>
<li>Easy to implement parsing algorithm.</li>
<li>Easy to adapt to modification of the expression.</li>
<li>Allows partial application of operator or Currying</li>
<li>And difficult to write and comprehend by humans. Wait. Noooooooo.</li>
</ol>

<p>
Hooman brain has now adjusted to comprehend mathematical expressions with brackets and it is hard for us to adapt now to Postfix notation. That is the upside of using infix notation and brackets. Because most of the world uses it. And it will be difficult to switch everyone to the prefix or postfix. I cannot make users to write query in postfix notation. That will be very unintuitive. Specially for people without mathematics background. So, I will just let them write keywords separated by commas and spaces and let them think about the expanded form which might invlove long expression with a lot of repetation. But they might never need to&#x2026;
</p>

<p>
I am thinking about what should I eat for dinner. The restaurant next to my house serves and and and burgers fries milkshakes not and salads sushi.
</p>
</div>
</section>
</main>
<footer id="postamble" class="status">
<hr>
<section>
<script src="https://giscus.app/client.js" 
  data-repo="ShriRambo/giscus-comments"
  data-repo-id="R_kgDOG1mtrQ"
  data-category="Announcements" 
  data-category-id="DIC_kwDOG1mtrc4CBJNW" 
  data-mapping="title" 
  data-reactions-enabled="1" 
  data-emit-metadata="0" 
  data-input-position="top" 
  data-theme="dark" 
  data-lang="en" 
  crossorigin="anonymous" 
  async> </script>
</section>
<hr>
<section>
  <p style="text-align:center">
Made with ❤️ and Emacs (Org-mode)
</p>
<div align=center>
  <a href="#" class='link-icon'>
    <i class="fa fa-home fa-lg" aria-hidden="true"></i>
  </a>
  <a href="https://www.instagram.com/shrirambo/" class='link-icon'>
    <i class="fa fa-instagram fa-lg" aria-hidden="true"></i>
  </a>
  <a href="https://github.com/shrirambo" class='link-icon'>
    <i class="fa fa-github fa-lg" aria-hidden="true"></i>
  </a>
  <a href='https://www.linkedin.com/in/shriram-ashirgade/' class='link-icon'>
    <i class="fa fa-linkedin-square fa-lg" aria-hidden="true"></i>
  </a>
  <a href='https://social.vivaldi.net/@shrirambo'>
    <i class="fa fa-mastodon fa-lg" aria-hidden="true"></i>
  </a>
  <a href='https://github.com/ShriRambo/sturdy-octo-winner/tree/master/content' class='link-icon'>
    <i class="fa fa-code  fa-lg" aria-hidden="true"></i>
  </a>
  <a href='#content' class='link-icon'>
    <i class="fa fa-hand-o-up  fa-lg" aria-hidden="true"></i>
  </a>
</div>
</div>
</footer>
</body>
</html>
